Revit 2027 API
KeynoteEntry(String, String, String) Constructor
 Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeynoteEntry(
	string key,
	string parentKey,
	string text
)
Public Sub New (
	key As String,
	parentKey As String,
	text As String
)
public:
KeynoteEntry(
	String^ key,
	String^ parentKey,
	String^ text
)
new :
        key : string *
        parentKey : string *
        text : string -> KeynoteEntry
Parameters
key String
 The key of this KeynoteEntry.
parentKey String
 The parent key of this KeynoteEntry. Empty string means this KeynoteEntry does not have a parent.
text String
 The text associated with this KeynoteEntry
Exceptions
Exception | Condition
ArgumentException |  key is an empty string.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
KeynoteEntry Class
KeynoteEntry Overload
Autodesk.Revit.DB Namespace